/*
* Copyright (c) 2015, 深圳市优必选科技有限公司
* All rights reserved.
* 
* 文件名称：DataPool.h
* 创建时间：2015/07/22 16:22
* 文件标识：
* 文件摘要：数据缓冲池
* 
* 当前版本：1.0.0.0
* 作    者：ZDJ
* 完成时间：2015/07/22 16:22
* 版本摘要：
*/
#ifndef DATAPOOL_H
#define DATAPOOL_H

extern map<int, int> g_mapProtocolAnswerLen;//协议应答长度

/**************************************************************************
* 函数名: GetProtocolAnswerLen
* 功能: 获取协议应答长度
* 参数: 
*    @[in ] nProtoId: 协议号
* 返回值: 成功返回数据长度，失败返回-1
* 时间: 2015/07/16 17:40
* 作者: ZDJ
*/
extern int GetProtocolAnswerLen(int nProtoId);

/**************************************************************************
* 函数名: SetProtocolAnswerLen
* 功能: 设置协议应答长度
* 参数:
*    @[in ] nProtoId: 协议号
*    @[in ] nProtoLen: 协议数据长度
* 返回值: 成功返回true，失败返回false
* 时间: 2015/07/16 17:40
* 作者: ZDJ
*/
extern bool SetProtocolAnswerLen(int nProtoId, int nProtoLen);

/**************************************************************************
* 函数名: InitProtocolAnswerLen
* 功能: 初始化协议应答数据长度
* 时间: 2015/07/16 18:03
* 作者: ZDJ
*/
extern void InitProtocolAnswerLen();

/**************************************************************************
* 函数名: ExistProtocol
* 功能: 是否存在协议
* 参数: 
*    @[in ] nProtoId: 协议号
* 返回值: 存在返回TRUE，否则返回FALSE
* 时间: 2015/09/21 20:32
* 作者: ZDJ
*/
extern BOOL ExistProtocol(int nProtoId);

/**************************************************************************
* 函数名: IsBlueToothCmd
* 功能: 判断是否是蓝牙指令
* 参数: 
*    @[in ] pData: 指令数据
*    @[in ] nLen: 指令长度
* 返回值: 是否是蓝牙指令
* 时间: 2015/11/16 10:57
* 作者: ZDJ
*/
extern BOOL IsBlueToothCmd(byte* pData, int nLen);

/**************************************************************************
* 函数名: GetChkSum
* 功能: 获取校验值
* 参数:
*    @[in ] pDataBuf: 数据缓冲区
*    @[in ] nDataLen: 数据长度
* 返回值: 校验值
* 时间: 2015/10/29 9:14
* 作者: ZDJ
*/
extern byte GetChkSum(byte* pDataBuf, int nDataLen);

//数据包
typedef struct PKGDATA
{	
private:
	vector<byte> m_myDataList; //数据列表
	BOOL m_bBegin; //接收开始标识
	BOOL m_bEnd;   //接收完毕标识
public:
	PKGDATA();

	/**************************************************************************
	* 函数名: GetByteData
	* 功能: 获取数据包，成功时需在外释放
	* 时间: 2015/07/20 17:16
	* 作者: ZDJ
	*/
	byte* GetByteData();

	/**************************************************************************
	* 函数名: GetVecData
	* 功能: 获取数据包
	* 时间: 2015/07/20 17:16
	* 作者: ZDJ
	*/
	vector<byte> GetVecData();

	/**************************************************************************
	* 函数名: PushData
	* 功能: 存储数据
	* 时间: 2015/07/20 17:17
	* 作者: ZDJ
	*/
	void PushData(byte data);

	/**************************************************************************
	* 函数名: ClearData
	* 功能: 清理数据
	* 时间: 2015/07/20 17:18
	* 作者: ZDJ
	*/
	void ClearData();

	/**************************************************************************
	* 函数名: IsEnd
	* 功能: 数据包是否接收完毕
	* 时间: 2015/07/20 17:18
	* 作者: ZDJ
	*/
	BOOL IsEnd();

	/**************************************************************************
	* 函数名: IsBegin
	* 功能: 数据包是否开始接收
	* 时间: 2015/07/20 17:18
	* 作者: ZDJ
	*/
	BOOL IsBegin();

	/**************************************************************************
	* 函数名: GetHead
	* 功能: 获取数据包的指令id
	* 时间: 2015/07/20 17:18
	* 作者: ZDJ
	*/
	byte GetHead();

	/**************************************************************************
	* 函数名: GetSize
	* 功能: 获取数据长度
	* 时间: 2015/07/27 15:39
	* 作者: ZDJ
	*/
	int GetSize();

	/**************************************************************************
	* 函数名: IsValid
	* 功能: 检测是否是合法协议
	* 时间: 2015/09/22 9:44
	* 作者: ZDJ
	*/
	BOOL IsValid();

}PKGDATA;

//数据缓冲池
class UBXROBOTCONTROLLER_API CDataPool
{	
private:	
	vector<PKGDATA*> m_vecPkgList; //数据包列表
	PKGDATA*  m_pCurPkg; //当前正在接收的数据包

public:
	CDataPool();
	~CDataPool();

	/**************************************************************************
	* 函数名: PushData
	* 功能: 存储数据
	* 参数: 	
	*    @[in ] myData: 数据
	* 返回值: 接收完毕返回指令id，否则返回-1
	* 时间: 2015/07/17 17:09
	* 作者: ZDJ
	*/
	int PushData(byte myData);	

	/**************************************************************************
	* 函数名: GetPkg
	* 功能: 获取数据包
	* 参数: 
	*    @[in ] cmdId: 指令id
	* 返回值: 成功返回数据包，失败返回NULL
	* 时间: 2015/07/20 17:12
	* 作者: ZDJ
	*/
	PKGDATA* GetPkg(int cmdId);	

	/**************************************************************************
	* 函数名: ClearData
	* 功能: 清空数据包
	* 参数: 
	*    @[in ] cmdId: 指令id
	* 时间: 2015/07/17 17:51
	* 作者: ZDJ
	*/
	void ClearData(int cmdId);	
};

#endif
